🚀&nbsp; env0 had composed a PR Plan for environment [Terraform Example / production ](https://app.env0.com/p/7e42bc84-96b5-4134-afcb-48bf9ca14ae5/environments/2f99ba14-db12-4356-9d1d-b6186bbcdbb2?organizationId=1649446b-b80b-4162-881c-2e5d319c8e50):
```
Plan: 2 to add, 3 to change, 0 to destroy.
```
<details>
<summary>Plan Details</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place

Terraform will perform the following actions:


  # module.api_access[0].aws_route53_record.api will be created
+   resource "aws_route53_record" "api" {
+       allow_overwrite = (known after apply)
+       fqdn            = (known after apply)
+       id              = (known after apply)
+       name            = "api.example.com"
+       records         = [
+           "18.132.149.19",
        ]
+       ttl             = 300
+       type            = "A"
+       zone_id         = (known after apply)
    }

  # module.api_access[0].aws_route53_zone.api will be created
+   resource "aws_route53_zone" "api" {
+       arn                 = (known after apply)
+       comment             = "Managed by Terraform"
+       force_destroy       = false
+       id                  = (known after apply)
+       name                = "api.example.com"
+       name_servers        = (known after apply)
+       primary_name_server = (known after apply)
+       tags                = {
+           "Environment" = "production"
+           "Purpose"     = "api-endpoint"
        }
+       tags_all            = {
+           "Environment" = "production"
+           "Purpose"     = "api-endpoint"
        }
+       zone_id             = (known after apply)
    }

  # module.api_access[0].aws_security_group.customer_access will be updated in-place
!   resource "aws_security_group" "customer_access" {
        id                     = "sg-085ee012c9855643f"
!       ingress                = [
+           {
+               cidr_blocks      = [
+                   "192.0.2.128/25",
                ]
+               description      = "Dharma Initiative"
+               from_port        = 443
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 443
            },
+           {
+               cidr_blocks      = [
+                   "198.51.100.64/29",
                ]
+               description      = "Oceanic Airlines"
+               from_port        = 443
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 443
            },
+           {
+               cidr_blocks      = [
+                   "203.0.113.200/32",
                ]
+               description      = "Wonka Industries"
+               from_port        = 443
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 443
            },
            # (5 unchanged elements hidden)
        ]
        name                   = "customer-api-access"
        tags                   = {
            "Environment"     = "production"
            "Name"            = "customer-api-access"
            "Purpose"         = "customer-whitelist"
            "Team"            = "platform"
            "UpdateFrequency" = "high"
        }
        # (7 unchanged attributes hidden)
    }


  # module.api_access[0].aws_security_group.internal_services will be updated in-place
!   resource "aws_security_group" "internal_services" {
        id                     = "sg-08c3767d4eeede7b5"
!       ingress                = [
-           {
-               cidr_blocks      = [
-                   "10.0.0.0/8",
                ]
-               description      = "Health check endpoint"
-               from_port        = 8080
-               ipv6_cidr_blocks = []
-               prefix_list_ids  = []
-               protocol         = "tcp"
-               security_groups  = []
-               self             = false
-               to_port          = 8080
            },
-           {
-               cidr_blocks      = [
-                   "10.0.0.0/8",
                ]
-               description      = "Internal HTTPS - monitoring, service mesh, internal tools"
-               from_port        = 443
-               ipv6_cidr_blocks = []
-               prefix_list_ids  = []
-               protocol         = "tcp"
-               security_groups  = []
-               self             = false
-               to_port          = 443
            },
-           {
-               cidr_blocks      = [
-                   "10.0.0.0/8",
                ]
-               description      = "Prometheus metrics scraping"
-               from_port        = 9090
-               ipv6_cidr_blocks = []
-               prefix_list_ids  = []
-               protocol         = "tcp"
-               security_groups  = []
-               self             = false
-               to_port          = 9090
            },
+           {
+               cidr_blocks      = [
+                   "10.50.0.0/16",
                ]
+               description      = "Health check endpoint"
+               from_port        = 8080
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 8080
            },
+           {
+               cidr_blocks      = [
+                   "10.50.0.0/16",
                ]
+               description      = "Internal HTTPS - monitoring, service mesh, internal tools"
+               from_port        = 443
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 443
            },
+           {
+               cidr_blocks      = [
+                   "10.50.0.0/16",
                ]
+               description      = "Prometheus metrics scraping"
+               from_port        = 9090
+               ipv6_cidr_blocks = []
+               prefix_list_ids  = []
+               protocol         = "tcp"
+               security_groups  = []
+               self             = false
+               to_port          = 9090
            },
        ]
        name                   = "internal-services"
        tags                   = {
            "Critical"        = "true"
            "Environment"     = "production"
            "Name"            = "internal-services"
            "Purpose"         = "internal-mesh"
            "Team"            = "platform"
            "UpdateFrequency" = "low"
        }
        # (7 unchanged attributes hidden)
    }

  # module.heritage[0].aws_rds_cluster.face_database will be updated in-place
!   resource "aws_rds_cluster" "face_database" {
        id                                    = "facial-recognition-terraform-example"
        tags                                  = {}
        # (46 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 3 to change, 0 to destroy.

```
</details>


```
Monthly cost change for overmindtech/terraform-example/env0_tf_plan.json
Amount:  +$0.50 ($389 → $390)
Percent: 0%
```
<details>
<summary>Cost Estimation Details</summary>

```diff
Key: * usage cost, ~ changed, + added, - removed

──────────────────────────────────
Project: overmindtech/terraform-example/env0_tf_plan.json

+ module.api_access[0].aws_route53_zone.api
  +$0.50

+     Hosted zone
      +$0.50

+ module.api_access[0].aws_route53_record.api
  Monthly cost depends on usage

+     Standard queries (first 1B)
      Monthly cost depends on usage
        +$0.40 per 1M queries

+     Latency based routing queries (first 1B)
      Monthly cost depends on usage
        +$0.60 per 1M queries

+     Geo DNS queries (first 1B)
      Monthly cost depends on usage
        +$0.70 per 1M queries

Monthly cost change for overmindtech/terraform-example/env0_tf_plan.json
Amount:  +$0.50 ($389 → $390)
Percent: 0%

──────────────────────────────────
Key: * usage cost, ~ changed, + added, - removed

*Usage costs can be estimated by updating Infracost Cloud settings, see docs for other options.

149 cloud resources were detected:
∙ 51 were estimated
∙ 96 were free
∙ 2 are not supported yet, see https://infracost.io/requested-resources:
  ∙ 1 x aws_cloudfront_monitoring_subscription
  ∙ 1 x aws_cloudwatch_query_definition

Infracost estimate: Monthly estimate increased by $0.50 ↑
┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━┳━━━━━━━━━━━━━━┓
┃ Changed project                                    ┃ Baseline cost ┃ Usage cost* ┃ Total change ┃
┣━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━╋━━━━━━━━━━━━━━┫
┃ overmindtech/terraform-example/env0_tf_plan.json   ┃        +$0.50 ┃           - ┃  +$0.50 (0%) ┃
┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━┻━━━━━━━━━━━━━━┛
```
</details>



[Full PR Plan logs on env0](https://app.env0.com/p/7e42bc84-96b5-4134-afcb-48bf9ca14ae5/environments/2f99ba14-db12-4356-9d1d-b6186bbcdbb2/deployments/72a395e7-ecfe-4183-ba31-d0d537d4563b?organizationId=1649446b-b80b-4162-881c-2e5d319c8e50)
